TexasInstruments/mspm0-sdk/source/ti/smbus/smbus.h
/* --COPYRIGHT--,BSD
 * Copyright (c) 2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
#ifndef __SMBUS_H__
#define __SMBUS_H__

//*****************************************************************************
//
//! \addtogroup smbus Application API layer
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//
// Include files
//
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

//*****************************************************************************
// defines
//*****************************************************************************


//*****************************************************************************
// Configuration
//*****************************************************************************

//*****************************************************************************
//
//! Enables Host Notify support as target
//
//*****************************************************************************
#ifndef SMB_TARGET_SUPPORTS_HOST_NOTIFY
#define SMB_TARGET_SUPPORTS_HOST_NOTIFY         (true)
#endif

//*****************************************************************************
//
//! Enables Host Notify support as Controller
//
//*****************************************************************************
#ifndef SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY
#define SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY     (true)
#endif

//*****************************************************************************
// Constant definitions
//*****************************************************************************

//*****************************************************************************
//
//! Maximum payload as specified by SMBus Spec
//
//*****************************************************************************
#define SMB_MAX_PAYLOAD_SIZE                    (255)

//*****************************************************************************
//
//! Max packet size = Payload+PEC+CMD+Len
//
//*****************************************************************************
#define SMB_MAX_PACKET_SIZE                     (SMB_MAX_PAYLOAD_SIZE + 3)

//*****************************************************************************
//
//! Host Alert packet size = Address + Data Byte Low + Data Byte High
//
//*****************************************************************************
#define SMB_HOST_ALERT_PACKET_SIZE              (3)

//*****************************************************************************
//
//! Default Host Address used for Host Alert
//
//*****************************************************************************
#define SMB_HOST_DEFAULT_ADDRESS                (0x08)

//*****************************************************************************
//
//! Default response when there's nothing to send
//
//*****************************************************************************
#define RESPONSE_NTR                             0x00

//*****************************************************************************
//
//! Return value when successful
//
//*****************************************************************************
#define SMBUS_RET_OK                            (1)
#define SMBUS_RET_OK_FIXED                      (2)
#define SMBUS_RET_OK_BLOCK                      (3)


//*****************************************************************************
//
//! Return value when an error ocurred
//
//*****************************************************************************
#define SMBUS_RET_ERROR                         (-1)

//*****************************************************************************
//
//! Definition when using variable lenght for block transactions
//
//*****************************************************************************
#define SMBUS_BLOCK_LENGTH                      (0xFFFF)

//*****************************************************************************
// typedefs
//*****************************************************************************

//*****************************************************************************
//
//! List of stop codes used within the NWK and PHY layers
//
//*****************************************************************************
typedef enum
{
    SMBus_Stop_After_Transfer = 0,
    SMBus_No_Stop_After_Transfer
} SMBus_Stop;

//*****************************************************************************
//
//! List of start codes used within the NWK and PHY layers
//
//*****************************************************************************
typedef enum
{
    SMBus_Start_Before_Transfer = 0,
    SMBus_No_Start_Before_Transfer
} SMBus_Start;

//*****************************************************************************
//
//! List of auto ack codes used within the NWK and PHY layers
//
//*****************************************************************************
typedef enum
{
    SMBus_Auto_Ack_Last_Byte = 0,
    SMBus_No_Auto_Ack_Last_Byte
} SMBus_Auto_Ack;

//*****************************************************************************
//
//! SMBus control register
//
//*****************************************************************************
typedef union
{
    //*****************************************************************************
    //
    //! Defines the control bit fields
    //
    //*****************************************************************************
    struct
    {
    /*! Enables PEC functionality */
        uint8_t pecEn       : 1;
    /*! Enable Host Notify  */
        uint8_t hostNotifyEn : 1;
    /*! SW_ACK is enabled (read only) */
        uint8_t swackEn     : 1;
    /*! Interrupts are enabled (read only) */
        uint8_t intEn       : 1;
    /*! SMBus PHY is enabled (read only) */
        uint8_t phyEn       : 1;
    /*! Acting in Controller mode (read only) */
        uint8_t controller  : 1;
    /*! Reserved */
        uint8_t reserved2   : 2;
    } bits;
    //*****************************************************************************
    //
    //! Allows access to the writeable bits on the structure
    //
    //*****************************************************************************
    struct
    {
    /*! Control bits that are writable */
        uint8_t writeBits  : 2;
    /*! Masks the read only control */
        uint8_t reserved   : 6;
    } writeableBits;
    /*! Whole Control byte access */
    uint8_t u8byte;
} SMBus_Ctrl;

//*****************************************************************************
//
//! Physical and Data Link Layer object
//
//*****************************************************************************
typedef struct
{
    /*! I2C register map struct */
    I2C_Regs*  SMBus_Phy_i2cBase;  
    /*! Send different types of Stop as controller */
    SMBus_Stop SMBus_Phy_stop;     
    /*! Waiting for ACK */
    bool       SMBus_Phy_AckPending;
} SMBus_Phy;

//*****************************************************************************
//
//! SMBus network layer states
//
//*****************************************************************************
typedef enum
{
    /*! Network is idle and waiting for new packet */
    SMBus_NwkState_Idle = 0,              
    /*! Network is receiving a packet */
    SMBus_NwkState_RX,                    
    /*! Network is transmitting after receive byte */
    SMBus_NwkState_TX,
    /*! Network is transmitting Host Alert*/
    SMBus_NwkState_TXHostAlert,
    /*! Network is sending Quick Command */
    SMBus_NwkState_TXQuickCMD,            
    /*! Network is transmitting a response after restart */
    SMBus_NwkState_TX_Resp,               
    /*! Network is transmitting a block */
    SMBus_NwkState_TX_Block,              
    /*! Network is receiving a block */
    SMBus_NwkState_RX_Block_Byte_Count,   
    /*! Network is receiving a block */
    SMBus_NwkState_RX_Block_Payload,      
    /*! Network is finishing transfer */
    SMBus_NwkState_Ending,                
    /*! Network error detected */
    SMBus_NwkState_Error                  
} SMBus_NwkState;

/****************************************************************************** */

//
//! Definition of SMBus Network structure
//
//*****************************************************************************
typedef struct
{
    /*! Network state machine */
    volatile SMBus_NwkState eState;       
    /*! Current Address+R/W */
    uint8_t currentAddr;                  
    /*! Current Command */
    uint8_t currentCmd;                   
    /*! RX Byte counter */
    uint16_t rxIndex;
    /*! Bytes to receive */
    uint16_t rxLen;
    /*! Max size of buffer */
    uint16_t rxSize;
    /*! Reception Buffer pointer */
    uint8_t *rxBuffPtr;                   
    /*! Byte counter */
    uint16_t txIndex;
    /*! Bytes to send */
    uint16_t txLen;
    /*! Transmission pointer */
    uint8_t *txBuffPtr;                   
    /*! Receive Byte response */
    uint8_t *recByteTxPtr;                
    /*! Max size of buffer */
    uint16_t txSize;
    /*! PEC block length override */
    uint8_t pecBlockLenOverride;
    /*! Host Notify Buffer pointer */
    uint8_t *hostNotifyRxBuffPtr;
} SMBus_Nwk;

//*****************************************************************************
//
//! List of error codes used by the application to indicate an error to the library
//
//*****************************************************************************
typedef enum
{
    /*! No error detected */
    SMBus_ErrorCode_NoError = 0,   
    /*! Incorrect packet was received */
    SMBus_ErrorCode_Packet,        
    /*! Command is not supported */
    SMBus_ErrorCode_Cmd            
} SMBus_ErrorCode;

//*****************************************************************************
//
//! SMBus state sent to application layer
//
//*****************************************************************************
typedef enum
{
    /*! Nothing special to report */
    SMBus_State_OK = 0,                 
    /*! Incorrect packet size */
    SMBus_State_DataSizeError,          
    /*! PEC Error detected */
    SMBus_State_PECError,               
    /*! Timeout Error */
    SMBus_State_TimeOutError,           
    /*! 1st byte (cmd) received */
    SMBus_State_Target_FirstByte, 
    /*! Case where second byte is length in a block command */
    SMBus_State_Target_ByteReceived,     
    /*! Quick Command detected */
    SMBus_State_Target_QCMD,             
    /*! Complete packet received by target */
    SMBus_State_Target_CmdComplete,      
    /*! SMBus Target Error */
    SMBus_State_Target_Error,            
    /*! SMBus Buffers haven't been initialized */
    SMBus_State_Target_NotReady,         
    /*! No Interrupt flags detected */
    SMBus_State_Target_NTR,              
    /*! Arbitration Lost */
    SMBus_State_Controller_ArbLost,         
    /*! Unexpected NACKed */
    SMBus_State_Controller_NACK,            
    /*! SMBus Controller error */
    SMBus_State_Controller_Error,           
    /*! SMBus Controller Host Notify Received*/
    SMBus_State_Controller_HostNotify,
    /*! SMBus State Unknown */
    SMBus_State_Unknown
} SMBus_State;

/****************************************************************************** */

//
//! SMBus Status Register
//
//*****************************************************************************
typedef union
{
    //*****************************************************************************
    //
    //! Status flag register
    //
    //*****************************************************************************
    struct
    {
        /*! PEC error */
        uint8_t pecErr      : 1;    
        /*! Timeout error */
        uint8_t toErr       : 1;    
        /*! Error in packet format */
        uint8_t packErr     : 1;    
        /*! Packet Overrun error */
        uint8_t packOvrErr  : 1;    
        /*! Byte Overrun error */
        uint8_t byteOvrErr  : 1;    
        /*! Incorrect command */
        uint8_t cmdErr      : 1;    
        /*! Reserved bits */
        uint8_t reserved    : 2;    
    } bits;
    /*! Whole status byte access */
    uint8_t u8byte;
} SMBus_Status;

//*****************************************************************************
//
//! Main SMBus object
//
//*****************************************************************************
typedef struct
{
    /*! PHY and DataLink object */
    SMBus_Phy phy;                  
    /*! Network object */
    SMBus_Nwk nwk;                  
    /*! SMBus Control register */
    SMBus_Ctrl ctrl;                
    /*! SMBus Status register */
    SMBus_Status status;            
    /*! SMBus reported state */
    SMBus_State state;              
    /*! Own Target address */
    uint8_t ownTargetAddr;           
} SMBus;

//*****************************************************************************
// globals
//*****************************************************************************

//*****************************************************************************
// Public functions called by applications
//*****************************************************************************
//*****************************************************************************
//
//! \brief   Clears the current state of SMBus
//
//!  Must be called by application in order to clear the state machine
//!  when a byte/packet was processed
//
//! \param smbus     Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_processDone(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Returns the number of received bytes from last transaction
//
//! \param smbus     Pointer to SMBus structure
//
//! \return  Number of bytes in the RX buffer. PEC byte is *not* included.
//
//*****************************************************************************
extern uint16_t SMBus_getRxPayloadAvailable(SMBus *smbus);

//*****************************************************************************
//
//! \brief  Returns the state of the SMBus module
//
//! \param smbus    Pointer to SMBus structure
//
//! \return State of the SMBus module
//
//*****************************************************************************
extern SMBus_State SMBus_getState(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Enables PEC support
//
//! \param smbus    Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_enablePEC(SMBus *smbus);
//*****************************************************************************
//
//! \brief   Disables PEC support
//
//! \param smbus    Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_disablePEC(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Initialize the SMBus interface as a target
//
//! Initializes the NWK and PHY layers.
//
//!  \param smbus     Pointer to SMBus structure
//!  \param i2cAddr   Base address of I2C module.
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetInit(SMBus *smbus, I2C_Regs *i2cAddr);

//*****************************************************************************
//
//! \brief   Enables the I2C interrupts for a target
//
//! This function enables the I2C Start, Stop, RX, TX, Timeout interrupts
//
//! \param smbus     Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetEnableInt(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Disables the I2C interrupts for a target
//
//! This function disables the I2C Start, Stop, RX, TX, Timeout interrupts
//
//! \param smbus     Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetDisableInt(SMBus *smbus);

//*****************************************************************************
//
//! \brief   I2C Interrupt Service routine for a target
//
//! Handles the interrupts for SMBus passing information to NWK layer
//! Should be called by application when I2C interrupt is detected
//
//! \param smbus    Pointer to SMBus structure
//
//! \return  Processing State (SMBus_State)
//!       - \b SMBus_State_Target_NotReady - Packet is not ready
//!       - \b SMBus_State_Target_FirstByte - First byte received (application can use
//!                                    it to validate the command)
//!       - \b SMBus_State_Target_ByteReceived - Byte 2+ received (application can use
//!                                    it to validate each byte)
//!       - \b SMBus_State_Target_QCMD - Quick command received
//!       - \b SMBus_State_Target_CmdComplete - Packet complete and if PEC enabled,
//!                                    validated.
//
//*****************************************************************************
extern SMBus_State SMBus_targetProcessInt(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Force reset to SMBus controller interface
//
//! Resets the network and PHY layers
//
//! \param smbus    Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_controllerReset(SMBus *smbus);

//*****************************************************************************
//
//! \brief  Set the target's own I2C address
//
//! \param smbus     Pointer to SMBus structure
//! \param targetAddr  Target I2C address
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetSetAddress(SMBus *smbus,
                                  uint8_t targetAddr);

//*****************************************************************************
//
//! \brief   Initialize the reception buffer for target
//
//! \param smbus     Pointer to SMBus structure
//! \param data      Pointer to Application RX buffer
//! \param size       Maximum size of buffer
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetSetRxBuffer(SMBus *smbus,
                                   uint8_t *data,
                                   uint16_t size);

//*****************************************************************************
//
//! \brief   Initialize the transmission buffer for target
//
//! \param smbus    Pointer to SMBus structure
//! \param data     Pointer to Application TX buffer
//! \param size      Maximum size of buffer
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetSetTxBuffer(SMBus *smbus,
                                   uint8_t *data,
                                   uint16_t size);

//*****************************************************************************
//
//! \brief   Reports an error to SMBus driver from the target
//
//! Used to signal an error when incorrect command/data is detected by the target
//
//! \param smbus       Pointer to SMBus structure
//! \param errorCode    SMBus_ErrorCode
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_targetReportError(SMBus *smbus,
                                   SMBus_ErrorCode errorCode);

//*****************************************************************************
//
//! \brief   Return the current command (Rxbuffer[0]) received by the target
//
//! \param smbus       Pointer to SMBus structure
//
//! \return  Current command byte
//
//*****************************************************************************
extern uint8_t SMBus_targetGetCommand(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Report to hardware that the command type is a block command
//
//! \param smbus       Pointer to SMBus structure
//
//*****************************************************************************
extern void SMBus_targetReportBlock(SMBus *smbus);

//*****************************************************************************
//
//! \brief   Report to hardware the fixed length of a given command
//
//! \param smbus       Pointer to SMBus structure
//! \param length	   Length of payload (without PEC byte), max supported is 0xFF
//
//*****************************************************************************
extern void SMBus_targetReportLength(SMBus *smbus, uint16_t length);

//*****************************************************************************
//
//! \brief   Clear the target's status register
//
//! \param smbus    Pointer to SMBus structure
//! \param val       Bits cleared from status register (1=X, 0=clear)
//
//! \return  Value of Status register after clearing flags
//
//*****************************************************************************
extern uint8_t SMBus_targetClearStatusReg(SMBus *smbus,
                                         uint8_t val);

